<!-- add-pr-comment:add-pr-comment -->

## Terraform auth0 (operations-engineering-test) plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # auth0_attack_protection.attack_protection will be created
  + resource "auth0_attack_protection" "attack_protection" {
      + id = (known after apply)

      + breached_password_detection {
          + admin_notification_frequency = (known after apply)
          + enabled                      = false
          + method                       = "standard"
          + shields                      = (known after apply)

          + pre_user_registration {
              + shields = (known after apply)
            }
        }

      + brute_force_protection {
          + allowlist    = (known after apply)
          + enabled      = true
          + max_attempts = 10
          + mode         = "count_per_identifier_and_ip"
          + shields      = [
              + "block",
              + "user_notification",
            ]
        }

      + suspicious_ip_throttling {
          + allowlist = (known after apply)
          + enabled   = true
          + shields   = [
              + "admin_notification",
              + "block",
            ]

          + pre_login {
              + max_attempts = 100
              + rate         = 864000
            }

          + pre_user_registration {
              + max_attempts = 50
              + rate         = 1200
            }
        }
    }

  # auth0_client.default_app will be created
  + resource "auth0_client" "default_app" {
      + allowed_clients                       = []
      + allowed_logout_urls                   = []
      + allowed_origins                       = []
      + callbacks                             = []
      + client_aliases                        = []
      + client_id                             = (known after apply)
      + cross_origin_auth                     = false
      + custom_login_page_on                  = true
      + grant_types                           = [
          + "authorization_code",
          + "implicit",
          + "refresh_token",
          + "client_credentials",
        ]
      + id                                    = (known after apply)
      + is_first_party                        = true
      + is_token_endpoint_ip_header_trusted   = false
      + name                                  = "Default App"
      + oidc_conformant                       = true
      + require_pushed_authorization_requests = false
      + signing_keys                          = (sensitive value)
      + sso                                   = false
      + sso_disabled                          = false
      + web_origins                           = []

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 36000
          + secret_encoded      = false
        }

      + refresh_token {
          + expiration_type              = "non-expiring"
          + idle_token_lifetime          = 1296000
          + infinite_idle_token_lifetime = true
          + infinite_token_lifetime      = true
          + leeway                       = 0
          + rotation_type                = "non-rotating"
          + token_lifetime               = 2592000
        }
    }

  # auth0_client.github will be created
  + resource "auth0_client" "github" {
      + allowed_clients                       = []
      + allowed_logout_urls                   = []
      + allowed_origins                       = []
      + app_type                              = "regular_web"
      + callbacks                             = [
          + "https://github.com/orgs/ministryofjustice-test/saml/consume",
        ]
      + client_aliases                        = []
      + client_id                             = (known after apply)
      + cross_origin_auth                     = true
      + custom_login_page_on                  = true
      + description                           = "Web application to SSO into the ministryofjustice-test GitHub Organisations"
      + grant_types                           = [
          + "authorization_code",
          + "implicit",
          + "refresh_token",
          + "client_credentials",
        ]
      + id                                    = (known after apply)
      + is_first_party                        = true
      + is_token_endpoint_ip_header_trusted   = false
      + name                                  = "GitHub - Test Organisation"
      + oidc_conformant                       = true
      + organization_require_behavior         = "no_prompt"
      + require_pushed_authorization_requests = false
      + signing_keys                          = (sensitive value)
      + sso                                   = false
      + sso_disabled                          = false
      + web_origins                           = []

      + addons {
          + samlp {
              + create_upn_claim                   = true
              + digest_algorithm                   = "sha256"
              + include_attribute_name_format      = true
              + lifetime_in_seconds                = 3600
              + map_identities                     = false
              + map_unknown_claims_as_is           = false
              + mappings                           = {
                  + "email"   = "emails"
                  + "name"    = "full_name"
                  + "user_id" = "http://schemas.xmlsoap.org/ws/2005/05/identity/claims/nameidentifier"
                }
              + name_identifier_format             = "urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified"
              + name_identifier_probes             = [
                  + "http://schemas.xmlsoap.org/ws/2005/05/identity/claims/nameidentifier",
                ]
              + passthrough_claims_with_no_mapping = false
              + signature_algorithm                = "rsa-sha256"
              + typed_attributes                   = true
            }
        }

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 36000
          + secret_encoded      = false
        }

      + native_social_login {
          + apple {
              + enabled = false
            }
          + facebook {
              + enabled = false
            }
        }

      + refresh_token {
          + expiration_type              = "non-expiring"
          + idle_token_lifetime          = 2592000
          + infinite_idle_token_lifetime = true
          + infinite_token_lifetime      = true
          + leeway                       = 0
          + rotation_type                = "non-rotating"
          + token_lifetime               = 31557600
        }
    }

  # auth0_client.terraform_provider_auth0 will be created
  + resource "auth0_client" "terraform_provider_auth0" {
      + allowed_clients                       = []
      + allowed_logout_urls                   = []
      + allowed_origins                       = []
      + app_type                              = "non_interactive"
      + callbacks                             = []
      + client_aliases                        = []
      + client_id                             = (known after apply)
      + cross_origin_auth                     = false
      + custom_login_page_on                  = true
      + grant_types                           = [
          + "client_credentials",
        ]
      + id                                    = (known after apply)
      + is_first_party                        = true
      + is_token_endpoint_ip_header_trusted   = false
      + name                                  = "Terraform Provider Auth0"
      + oidc_conformant                       = true
      + require_pushed_authorization_requests = false
      + signing_keys                          = (sensitive value)
      + sso                                   = false
      + sso_disabled                          = false
      + web_origins                           = []

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 36000
          + secret_encoded      = false
        }

      + refresh_token {
          + expiration_type              = "non-expiring"
          + idle_token_lifetime          = 2592000
          + infinite_idle_token_lifetime = true
          + infinite_token_lifetime      = true
          + leeway                       = 0
          + rotation_type                = "non-rotating"
          + token_lifetime               = 31557600
        }
    }

  # auth0_connection.google_oauth2 will be created
  + resource "auth0_connection" "google_oauth2" {
      + id                   = (known after apply)
      + is_domain_connection = false
      + name                 = "google-oauth2"
      + realms               = [
          + "google-oauth2",
        ]
      + strategy             = "google-oauth2"

      + options {
          + allowed_audiences                    = (known after apply)
          + api_enable_users                     = false
          + authorization_endpoint               = (known after apply)
          + brute_force_protection               = false
          + debug                                = false
          + disable_cache                        = false
          + disable_self_service_change_password = false
          + disable_sign_out                     = false
          + disable_signup                       = false
          + domain_aliases                       = (known after apply)
          + enable_script_context                = false
          + enabled_database_customization       = false
          + forward_request_info                 = false
          + import_mode                          = false
          + ips                                  = (known after apply)
          + issuer                               = (known after apply)
          + jwks_uri                             = (known after apply)
          + map_user_id_to_id                    = false
          + non_persistent_attrs                 = (known after apply)
          + password_policy                      = (known after apply)
          + pkce_enabled                         = false
          + requires_username                    = false
          + scopes                               = [
              + "email",
              + "profile",
            ]
          + sign_in_endpoint                     = (known after apply)
          + sign_out_endpoint                    = (known after apply)
          + sign_saml_request                    = false
          + signing_cert                         = (known after apply)
          + strategy_version                     = 0
          + token_endpoint                       = (known after apply)
          + use_cert_auth                        = false
          + use_kerberos                         = false
          + use_wsfed                            = false
          + userinfo_endpoint                    = (known after apply)
          + waad_common_endpoint                 = false
        }
    }

  # auth0_connection.google_workspace will be created
  + resource "auth0_connection" "google_workspace" {
      + id                   = (known after apply)
      + is_domain_connection = false
      + name                 = "google-workspace-connection"
      + realms               = (known after apply)
      + show_as_button       = true
      + strategy             = "google-apps"

      + options {
          + allowed_audiences        = (known after apply)
          + api_enable_users         = true
          + authorization_endpoint   = (known after apply)
          + client_id                = (sensitive value)
          + client_secret            = (sensitive value)
          + domain                   = "digital.justice.gov.uk"
          + domain_aliases           = (known after apply)
          + ips                      = (known after apply)
          + issuer                   = (known after apply)
          + jwks_uri                 = (known after apply)
          + map_user_id_to_id        = (known after apply)
          + non_persistent_attrs     = (known after apply)
          + password_policy          = (known after apply)
          + scopes                   = [
              + "basic_profile",
              + "ext_profile",
            ]
          + set_user_root_attributes = "on_each_login"
          + sign_in_endpoint         = (known after apply)
          + sign_out_endpoint        = (known after apply)
          + signing_cert             = (known after apply)
          + strategy_version         = (known after apply)
          + tenant_domain            = "digital.justice.gov.uk"
          + token_endpoint           = (known after apply)
          + upstream_params          = jsonencode(
                {
                  + screen_name = {
                      + alias = "login_hint"
                    }
                }
            )
          + userinfo_endpoint        = (known after apply)
        }
    }

  # auth0_connection_client.google_workspace_github will be created
  + resource "auth0_connection_client" "google_workspace_github" {
      + client_id     = (sensitive value)
      + connection_id = (known after apply)
      + id            = (known after apply)
      + name          = (known after apply)
      + strategy      = (known after apply)
    }

  # auth0_resource_server.auth0_management_api will be created
  + resource "auth0_resource_server" "auth0_management_api" {
      + allow_offline_access                            = false
      + enforce_policies                                = (known after apply)
      + id                                              = (known after apply)
      + identifier                                      = "https://operations-engineering-test.uk.auth0.com/api/v2/"
      + name                                            = "Auth0 Management API"
      + signing_alg                                     = "RS256"
      + signing_secret                                  = (known after apply)
      + skip_consent_for_verifiable_first_party_clients = false
      + token_lifetime                                  = 86400
      + token_lifetime_for_web                          = 7200
    }

  # auth0_tenant.tenant will be created
  + resource "auth0_tenant" "tenant" {
      + allow_organization_name_in_authentication_api = false
      + allowed_logout_urls                           = []
      + customize_mfa_in_postlogin_action             = false
      + default_audience                              = (known after apply)
      + default_directory                             = (known after apply)
      + default_redirection_uri                       = (known after apply)
      + enabled_locales                               = [
          + "en",
        ]
      + friendly_name                                 = (known after apply)
      + id                                            = (known after apply)
      + idle_session_lifetime                         = 72
      + picture_url                                   = (known after apply)
      + sandbox_version                               = "18"
      + session_lifetime                              = 168
      + support_email                                 = (known after apply)
      + support_url                                   = (known after apply)

      + flags {
          + allow_legacy_delegation_grant_types    = false
          + allow_legacy_ro_grant_types            = false
          + allow_legacy_tokeninfo_endpoint        = false
          + dashboard_insights_view                = false
          + dashboard_log_streams_next             = false
          + disable_clickjack_protection_headers   = false
          + disable_fields_map_fix                 = false
          + disable_management_api_sms_obfuscation = false
          + enable_adfs_waad_email_verification    = false
          + enable_apis_section                    = false
          + enable_client_connections              = false
          + enable_custom_domain_in_emails         = false
          + enable_dynamic_client_registration     = false
          + enable_idtoken_api2                    = false
          + enable_legacy_logs_search_v2           = false
          + enable_legacy_profile                  = false
          + enable_pipeline2                       = false
          + enable_public_signup_user_exists_error = false
          + mfa_show_factor_list_on_enrollment     = false
          + no_disclose_enterprise_connections     = false
          + require_pushed_authorization_requests  = false
          + revoke_refresh_token_grant             = false
          + use_scope_descriptions_for_consent     = false
        }

      + session_cookie {}

      + sessions {
          + oidc_logout_prompt_enabled = false
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```